#
# \u00a9 Copyright IBM Corporation 2016.
# \u00a9 Copyright HCL Technologies Ltd. 2017.
# LICENSE: Apache License, Version 2.0 https://www.apache.org/licenses/LICENSE-2.0
#
# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE

transfer.progress={0} % transf\u00e9r\u00e9(s)

message.created.scan=L'examen a \u00e9t\u00e9 envoy\u00e9 \u00e0 l'analyse.
message.running.scan=Cr\u00e9ation et ex\u00e9cution de l'examen...
message.uploading.file=T\u00e9l\u00e9chargement de {0} vers le service d''analyse...

error.authenticating=Une erreur s'est produite lors de l'authentification avec le service.
error.download.client=Une erreur s''est produite lors du t\u00e9l\u00e9chargement du package SAClientUtil. {0}
error.getting.details=Une erreur s''est produite lors de la r\u00e9cup\u00e9ration des d\u00e9tails de l''examen. {0}
error.getting.result=Une erreur s''est produite lors de la r\u00e9cup\u00e9ration du r\u00e9sultat de l''examen. {0}
error.invalid.app=Il n''existe pas d''application portant l''ID {0}.
error.invalid.job.id=L''ID de travail {0} n''est pas valide ou n''existe pas.
error.loading.apps=Une erreur s''est produite lors de l''extraction de la liste des applications. {0}
error.submit.scan=Une erreur s''est produite lors de l''envoi de l''examen au service. ERREUR : {0}
error.upload.file=Une erreur s''est produite lors du t\u00e9l\u00e9chargement de {0} vers le service. {0}

#Authentication
login.error=Echec de l'authentification aupr\u00e8s du service.
login.token.expired=Le jeton de connexion est arriv\u00e9 \u00e0 expiration ou n'est pas valide.

message.done=Terminer.
message.downloading.client=T\u00e9l\u00e9chargement du dernier package SAClientUtil...
message.extracting.client=Extraction du package SAClientUtil...
message.download.complete=T\u00e9l\u00e9chargement termin\u00e9.
message.preparing.irx=Pr\u00e9paration du fichier IRX \u00e0 l''aide de SAClientUtil version {0}...
message.saclient.old=Une version plus r\u00e9cente du package SAClientUtil est disponible :\nVersion actuelle : {0}\nVersion disponible : {1}

error.checking.local.version=Une erreur s'est produite lors de la v\u00e9rification de la version locale de SAClientUtil.
error.file.upload=Le t\u00e9l\u00e9chargement du fichier {0} a \u00e9chou\u00e9.
error.generating.irx=Des probl\u00e8mes sont survenus lors de la g\u00e9n\u00e9ration du fichier IRX. Pour plus d''informations, voir {0}.
error.submitting.irx=Des probl\u00e8mes sont survenus lors de l'envoi du fichier IRX au service d'analyse.
error.submitting.file=Des probl\u00e8mes sont survenus lors de l''envoi de {0} au service d''analyse.
error.invalid.scanner.type=Le type de scanner {0} n''est pas valide.
error.out.of.memory=Le t\u00e9l\u00e9chargement du package SAClientUtil a satur\u00e9 l'espace du segment m\u00e9moire. Augmentez l'espace disponible pour le segment \u00e0 l'aide de l'argument JVM -Xmx et r\u00e9essayez.
error.running.scan=Une erreur s''est produite lors de l''ex\u00e9cution de l''examen. {0}
error.scan.failed=Le processus d''analyse de s\u00e9curit\u00e9 a \u00e9chou\u00e9. {0}
error.target.invalid=La cible d''examen {0} n''est pas valide.
